src/cf/Catalogs/fmInfoStructures.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>fmInfoStructures</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>StructureType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.fmInfoStructureTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ViewFormat</Name>
					<Type>
						<v8:Type>cfg:EnumRef.fmRoundMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EditFormat</Name>
					<Type>
						<v8:Type>cfg:EnumRef.fmRoundMethods</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DontOutputRowsOutOfStructure</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BudgetTotalType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.fmBudgetTotalType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/fmInfoStructureTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>fmInfoStructureTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>IncomesAndExpensesBudget</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CashflowBudget</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Balance</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>KeyIndicators</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/fmBudgetTotalType.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>fmBudgetTotalType</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ByMonthes</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ByMonthesAndQuaters</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/fmBudgetFlowOperationTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>fmBudgetFlowOperationTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Incomes</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Expenses</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>InnerIncomes</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>InnerExpenses</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Inflow</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Outflow</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/fmInfoStructuresSections.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>fmInfoStructuresSections</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.fmInfoStructures</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Order</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ByFormula</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ItalicFont</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsBlankString</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StructureSectionType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.fmBudgetFlowOperationTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TextColor</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BoldFont</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>OutputDepartmentName</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>SectionStructureData</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Analytics</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.fmIncomesAndExpensesItems</v8:Type>
								<v8:Type>cfg:CatalogRef.fmItemGroups</v8:Type>
								<v8:Type>cfg:CatalogRef.fmCashflowItems</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Source</Name>
							<Comment>строка формулы</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.fmInfoStructuresSections</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Analytics1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.fmAnalyticsTypes</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Analytics2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.fmAnalyticsTypes</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Analytics3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.fmAnalyticsTypes</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Formula</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Minus</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Row</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.fmIncomesAndExpensesItems</v8:Type>
								<v8:Type>cfg:CatalogRef.fmInfoStructuresSections</v8:Type>
								<v8:Type>cfg:CatalogRef.fmCashflowItems</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Order</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/fmInfoStructures/Ext/ManagerModule.bsl
#If Server OR ThickClientOrdinaryApplication OR ExternalConnection Then

Procedure FillPredefinedValuesIncomesAndExpenses() Export
	
	CatObjectWithout = Catalogs.fmInfoStructures.WithoutStructureIE.GetObject();
	CatObjectWithout.StructureType = Enums.fmInfoStructureTypes.IncomesAndExpensesBudget;
	CatObjectWithout.BudgetTotalType = Enums.fmBudgetTotalType.ByMonthes;
	CatObjectWithout.Write();
	
	CatObjectOut = Catalogs.fmInfoStructures.OutOfStructureIE.GetObject();
	CatObjectOut.StructureType = Enums.fmInfoStructureTypes.IncomesAndExpensesBudget;
	CatObjectOut.BudgetTotalType = Enums.fmBudgetTotalType.ByMonthes;
	CatObjectOut.Write();
	
	NewIncome = Catalogs.fmInfoStructuresSections.CreateItem();
	NewIncome.Owner = CatObjectWithout.Ref;
	NewIncome.Description = NStr("en='INCOME';ru='ДОХОДЫ'");
	NewIncome.StructureSectionType = Enums.fmBudgetFlowOperationTypes.Incomes;
	NewIncome.Order = 1;
	NewIncome.BoldFont = True;
	NewIncome.Write();
	
	NewExpence = Catalogs.fmInfoStructuresSections.CreateItem();
	NewExpence.Owner = CatObjectWithout.Ref;
	NewExpence.Description = NStr("en='EXPENSES';ru='РАСХОДЫ'");
	NewExpence.StructureSectionType = Enums.fmBudgetFlowOperationTypes.Expenses;
	NewExpence.Order = 2;
	NewExpence.BoldFont = True;
	NewExpence.Write();
	
	OutOfStr = Catalogs.fmInfoStructuresSections.CreateItem();
	OutOfStr.Owner = CatObjectOut.Ref;
	OutOfStr.Description = NStr("en='OUT OF STRUCTURE';ru='ВНЕ СТРУКТУРЫ'");
	OutOfStr.Order = 1;
	OutOfStr.IsBlankString = True;
	OutOfStr.BoldFont = True;
	OutOfStr.Write();
	
	IncomeOutOfStr = Catalogs.fmInfoStructuresSections.CreateItem();
	IncomeOutOfStr.Owner = CatObjectOut.Ref;
	IncomeOutOfStr.Parent = OutOfStr.Ref;
	IncomeOutOfStr.Description = NStr("en='INCOME';ru='ДОХОДЫ'");
	IncomeOutOfStr.StructureSectionType = Enums.fmBudgetFlowOperationTypes.Incomes;
	IncomeOutOfStr.Order = 2;
	IncomeOutOfStr.BoldFont = True;
	IncomeOutOfStr.Write();
	
	ExpenceOutOfStr = Catalogs.fmInfoStructuresSections.CreateItem();
	ExpenceOutOfStr.Owner = CatObjectOut.Ref;
	ExpenceOutOfStr.Parent = OutOfStr.Ref;
	ExpenceOutOfStr.Description = NStr("en='EXPENSES';ru='РАСХОДЫ'");
	ExpenceOutOfStr.StructureSectionType = Enums.fmBudgetFlowOperationTypes.Expenses;
	ExpenceOutOfStr.Order = 3;
	ExpenceOutOfStr.BoldFont = True;
	ExpenceOutOfStr.Write();
	
EndProcedure

Procedure FillPredefinedValuesCashflow() Export
	
	CatObjectWithout = Catalogs.fmInfoStructures.WithoutStructureCF.GetObject();
	CatObjectWithout.StructureType = Enums.fmInfoStructureTypes.CashflowBudget;
	CatObjectWithout.BudgetTotalType = Enums.fmBudgetTotalType.ByMonthes;
	CatObjectWithout.Write();
	
	CatObjectOut = Catalogs.fmInfoStructures.OutOfStructureCF.GetObject();
	CatObjectOut.StructureType = Enums.fmInfoStructureTypes.CashflowBudget;
	CatObjectOut.BudgetTotalType = Enums.fmBudgetTotalType.ByMonthes;
	CatObjectOut.Write();
	
	NewInflow = Catalogs.fmInfoStructuresSections.CreateItem();
	NewInflow.Owner = CatObjectWithout.Ref;
	NewInflow.Description = NStr("en='INFLOW';ru='ПРИТОК'");
	NewInflow.StructureSectionType = Enums.fmBudgetFlowOperationTypes.Inflow;
	NewInflow.Order = 1;
	NewInflow.BoldFont = True;
	NewInflow.Write();
	
	NewOutflow = Catalogs.fmInfoStructuresSections.CreateItem();
	NewOutflow.Owner = CatObjectWithout.Ref;
	NewOutflow.Description = NStr("en='OUTFLOW';ru='ОТТОК'");
	NewOutflow.StructureSectionType = Enums.fmBudgetFlowOperationTypes.Outflow;
	NewOutflow.Order = 2;
	NewOutflow.BoldFont = True;
	NewOutflow.Write();
	
	OutOfStr = Catalogs.fmInfoStructuresSections.CreateItem();
	OutOfStr.Owner = CatObjectOut.Ref;
	OutOfStr.Description = NStr("en='OUT OF STRUCTURE';ru='ВНЕ СТРУКТУРЫ'");
	OutOfStr.Order = 1;
	OutOfStr.IsBlankString = True;
	OutOfStr.BoldFont = True;
	OutOfStr.Write();
	
	InflowOutOfStr = Catalogs.fmInfoStructuresSections.CreateItem();
	InflowOutOfStr.Owner = CatObjectOut.Ref;
	InflowOutOfStr.Parent = OutOfStr.Ref;
	InflowOutOfStr.Description = NStr("en='INFLOW';ru='ПРИТОК'");
	InflowOutOfStr.StructureSectionType = Enums.fmBudgetFlowOperationTypes.Inflow;
	InflowOutOfStr.Order = 2;
	InflowOutOfStr.BoldFont = True;
	InflowOutOfStr.Write();
	
	OutflowOutOfStr = Catalogs.fmInfoStructuresSections.CreateItem();
	OutflowOutOfStr.Owner = CatObjectOut.Ref;
	OutflowOutOfStr.Parent = OutOfStr.Ref;
	OutflowOutOfStr.Description = NStr("en='OUTFLOW';ru='ОТТОК'");
	OutflowOutOfStr.StructureSectionType = Enums.fmBudgetFlowOperationTypes.Outflow;
	OutflowOutOfStr.Order = 3;
	OutflowOutOfStr.BoldFont = True;
	OutflowOutOfStr.Write();
	
EndProcedure

#EndIf
